# coding=utf-8
# 3.24崔超作业  - py__作业06.py
# 2019/3/26 18:33
import sys
a = {"010":"北京",
     "021":"上海",
     "022":"天津",
     "023":"重庆",
     "024":"沈阳",
     "025":"南京",
     "028":"成都",
     "0411":"大连",
     "0412":"鞍山",
     "0415":"丹东",
     "0416":"锦州",
     "0418":"阜新",
     "0421":"朝阳"}
def put():
     key = input("请输入区号：")
     return a[key]
while True:
     Q = input("退出程序请输入q，否则请单击回车！")
     if Q.lower() == 'q':
          exit(0)
     else:
          print(put())
          break

# 弱警告：缩进不是4个空格的备注
# 如果输入的区号不存在，那就报错了，这点应该优化下吧？