a = {"010": "北京",
     "021": "上海",
     "022": "天津",
     "023": "重庆",
     "024": "沈阳",
     "025": "南京",
     "028": "成都",
     "0411": "大连",
     "0412": "鞍山",
     "0415": "丹东",
     "0416": "锦州",
     "0418": "阜新",
     "0421": "朝阳"}
def put():
    key = b
    return a[key]
while True:
    Q = input("回车进行下一步，输入q退出程序")
    if Q.lower() == 'q':
        exit(0)
    else:
        b = input("请输入正确的区号")
        if b in a:
            print(put())
            break
        else:
            print("您输入的值有误")
